Repository: OpenChain-Project/Reference-Material
Catalog: Training-Slides/Official/1.0/ko/Translation-Tools/Curriculum-Translation-KR-level2.tmx
Source language: en_us
Languages: ko

source: Support Requirements:
ko: 지원 요구사항:

source: T his type of failure can be avoided by ensuring that the completion of the FOSS training is part of the employee’s professional development plan and it is monitored for completion as part of the performance review
ko: 이러한 유형의 실패는 FOSS 교육이 직원의 전문 개발 계획의 일부임을 보장하고 성과 리뷰의 일환으로 완료 여부를 모니터링함으로써 방지할 수 있다.

source: Take steps to understand what FOSS is included in software delivered by suppliers
ko: 공급업체가 제공하는 소프트웨어에 FOSS가 포함되었는지 파악하기 위한 조치를 수행한다.

source: Templates such as these may be created by engineering teams to help educate the FOSS review team about planned FOSS usage.
ko: 이러한 템플릿은 계획된 FOSS 사용에 대해 FOSS 리뷰팀을 교육하는데 도움을 주기 위해 엔지니어링팀에서 만들 수 있습니다. (역자주) 1. Function call (함수 호출) : 제어권을 다음 함수로 넘기는 호출이다. (일반적으로 원 저작물과 Function call로 연결되는 소프트웨어는 원저작물의 2차적 저작물로 간주된다.) 2. Socket interface (소켓 인터페이스) : 네트워크 소켓(network socket)은 컴퓨터 네트워크를 경유하는 프로세스 간 통신의 종착점이다. (일반적으로 원 저작물과 소켓 인터페이스를 통해 통신을 하는 소프트웨어는 2차적 저작물로 간주되지 않는다.) 3. System call (시스템 호출) : 운영 체제의 커널이 제공하는 서비스에 대해, 응용 프로그램의 요청에 따라 커널에 접근하기 위한 인터페이스이다. GPL-2.0인 리눅스 커널을 시스템 콜 인터페이스로 접근하여 사용하는 응용 프로그램은 리눅스 커널의 2차적 저작물로 간주되지 않는다. 4. Shared headers (공유 헤더) : 라이브러리는 소프트웨어를 개발할 때 컴퓨터 프로그램이 사용하는 비휘발성 자원의 모임이며, 공유 라이브러리는 공유될 목적으로 만들어진 라이브러리이다. 공유 헤더는 한 소프트웨어에서 공유 라이브러리를 사용하기 위한 인터페이스를 제공한다. (일반적으로 공유 헤더를 통해 LGPL 라이브러리를 사용하는 소프트웨어의 경우, LGPL의 2차적 저작물로 간주되지 않는다. 하지만, GPL 라이브러리를 공유 헤더를 통해 사용하는 소프트웨어는 GPL의 2차적 저작물로 간주된다.)

source: The OpenChain Curriculum supports the Specification by providing freely available training material.
ko: OpenChain 커리큘럼 은 자유롭게 사용할 수있는 교육 자료를 제공함으로 설명서를 지원한다.

source: The OpenChain Project helps to identify and share the core components of a Free and Open Source Software (FOSS) compliance program.
ko: OpenChain 프로젝트는 FOSS(Free and Open Source Software) 컴플라이언스 프로그램의 핵심 구성 요소를 식별하고 공유하는데 도움이 된다.

source: The BSD license is an example of a permissive license that allows unlimited redistribution for any purpose in source or object code form as long as its copyright notices and the license's disclaimers of warranty are maintained
ko: BSD 라이선스는 저작권 고지 및 라이선스 면책 조항이 유지되는한 어떠한 목적으로든 소스 코드 또는 오브젝트 코드 형식으로 무제한 재배포를 허용하는 Permissive 라이선스의 한 예이다.

source: The FOSS Review is a basic building block of a FOSS Compliance Program.
ko: FOSS 리뷰는 FOSS 컴플라이언스 프로그램의 기본 구성 요소입니다.

source: The FOSS Review process crosses disciplines, including engineering, business, and legal teams.
ko: FOSS 리뷰 프로세스는 엔지니어링, 비지니스, 법무팀을 비롯한 여러 분야를 걸치게 된다.

source: The FOSS Review process includes the following steps:
ko: FOSS 리뷰 프로세스에는 다음 단계가 포함된다:

source: The FOSS Review process should be flexible enough to allow the interested parties to collaborate.
ko: FOSS 리뷰 프로세스는 이해 관계자가 협업 할 수있도록 충분히 유연해야합니다.

source: The FOSS Review process should have executive oversight to resolve disagreements and approve the most important decisions.
ko: FOSS 리뷰 프로세스는 의견 불일치를 해결하고 가장 중요한 결정을 승인할 수 있는 경영진의 감독을 받아야 한다.

source: The FOSS Review process should have oversight (for example, an Executive Review Committee in this diagram).
ko: FOSS 리뷰 프로세스에는 감독이 있어야합니다 (예 :이 다이어그램의 경영진 리뷰 위원회).

source: The FOSS Review team may consist of an interdisciplinary team
ko: FOSS 리뷰팀은 하나의 연합된 팀으로 구성될 수 있습니다.

source: The FOSS Review team should assess the information it has gathered before providing guidance for issues.
ko: FOSS 리뷰 팀은 문제에 대한 가이드를 제공하기 전에 수집한 정보를 평가해야한다.

source: The FOSS Review team should consider:
ko: FOSS 리뷰 팀은 다음을 고려해야한다.

source: The FOSS Review team should have the expertise to properly assess the FOSS usage. This may require support from engineering teams to educate legal and business teams about the proposed FOSS usage.
ko: FOSS 리뷰팀은 FOSS 사용을 적절히 평가할 수있는 전문 지식을 갖추고 있어야합니다. 이는 제안된 FOSS사용에 대해 법률 및 비즈니스팀을 교육하기 위해 엔지니어링 팀의 지원이 필요할 수 있습니다.

source: The appropriate engineers then conduct FOSS Reviews on the relevant source code (see next slide for template)
ko: 그러면 엔지니어는 관련 소스 코드에 대한 FOSS 리뷰를 수행한다. (다음 슬라이드의 템플릿 참조)

source: The approval and its conditions should be registered in a tracking system
ko: 승인 및 이에 대한 조건은 추적 시스템에 등록해야 한다.

source: The approval should also include important details such as version numbers of FOSS components and the approved usage scenario.
ko: 승인에는 FOSS 컴포넌트의 버전 번호 및 승인된 사용 시나리오와 같은 중요한 세부 사항도 포함되어야 합니다.

source: The approval should specify versions of approved FOSS components, the approved usage model for the component, and any other applicable obligations under the FOSS license
ko: 승인에서는 승인된 FOSS 컴포넌트의 버전, 컴포넌트의 승인된 사용 모델 및 FOSS 라이선스 하의 기타 해당되는 모든 의무 사항을 명시해야 한다.

source: The benefits of maintaining a good community relationship are that you can better assess how you can comply with the FOSS license requirements, and you have a better two-way communication with regard to contribution and use of the FOSS.
ko: 커뮤니티와 좋은 관계를 유지하는 것의 이점은 FOSS 라이선스 요구사항을 어떻게 준수할지에 대해 더 잘 가늠할 수 있으며, FOSS 기여 및 사용과 관련하여 더 나은 양방향 의사 소통이 가능하다는 것입니다.

source: The benefits of prioritizing compliance are that you become more efficient in your use of FOSS, and that you build a better relationship with the open source community.
ko: 컴플라이언스에 우선순위를 두는 것의 이점은 FOSS 사용에서 보다 효율적으로 되고, 오픈 소스 커뮤니티와 더 나은 관계를 구축할 수 있다는 것입니다.

source: The code owner is providing the source code under the FOSS license, but is not requiring that you provide the source code to others.
ko: 코드 소유자는 FOSS 라이선스하에 소스 코드를 제공하고 있지만, 다른 사람에게 소스 코드의 제공을 요구하지 않습니다.

source: The company also verifies that notices are properly produced and included in distribution packages as needed.
ko: 회사는 또한 고지가 적절히 제작되고 필요에 따라 배포 패키지에 포함되는지 확인합니다.

source: The company instead publishes the source code for the original version of the FOSS component.
ko: 대신 회사는 FOSS 컴포넌트의 원본 버전에 대한 소스 코드를 공개합니다.

source: The company may also scan the source code to verify the origin and composition of the code.
ko: 회사는 출처 및 코드의 구성을 확인하기 위해 소스 코드를 스캔할 수 있습니다.

source: The copyright notices, attribution and source code normally helps to identify who is licensing the FOSS software.
ko: 저작권 고지, 귀속에 대한 고지 및 소스 코드가 일반적으로 FOSS 소프트웨어의 라이선스를 부여하는 사람을 식별하는 데 도움이됩니다.

source: The copyright owner only has control over the work that he or she created, not someone else’s independent creation
ko: 저작권 소유자는 자신이 창작한 저작물에 대해서만 통제권을 가지고, 타인의 독립적인 창작물에 대해서는 통제권을 가지지 않는다.

source: The core of the OpenChain Project is the Specification .
ko: OpenChain 프로젝트의 핵심은 설명서(Specification) 이다.

source: The definition of “derivative work” is subject to different views in the FOSS community and its interpretation in law is likely to vary from jurisdiction to jurisdiction.
ko: “2차적 저작물”의 정의에 대해서는 FOSS 커뮤니티 내에 다른 견해들이 있고, 법적 해석은 관할 국가별로 차이가 있다.

source: The distribution package contains only software that has been reviewed and approved
ko: 배포 패키지에는 리뷰 및 승인된 소프트웨어만 포함된다.

source: The distributor cannot satisfy both conditions at once so the module may not be distributed.
ko: 배포자는 동시에 두가지 조건을 충족시킬 수 없으므로, 그 모듈은 배포될 수가 없다.

source: The engineering team will need the ability to provide further input.
ko: 엔지니어 팀은 더 많은 정보를 제공 할 수있는 능력이 필요할 것입니다.

source: The first is to know your obligations and have a process to support this knowledge.
ko: 첫째는 귀하의 의무를 알고 이 지식을 뒷받침하는 프로세스를 갖추는 것입니다.

source: The first pitfall described in this slide arises where copyleft-style licensed FOSS is inadvertently mixed with proprietary code.
ko: 이 슬라이드에서 설명하는 첫번째 함정은 Copyleft 스타일 라이선스의 FOSS가 의도하지 않게 독점 코드와 혼용되는 경우에 발생합니다.

source: The first pitfall in this slide arises where a company has an obligation to provide accompanying source code, but fails to do so.
ko: 이 슬라이드의 첫번째 함정은 회사가 동반하는 소스 코드를 제공할 의무가 있지만, 그렇게 하지 않은 경우에 발생합니다.

source: The first pitfall in this slide arises where copyleft-style licensed FOSS is inadvertently linked to proprietary code.
ko: 이 슬라이드의 첫번째 함정은 Copyleft 스타일 라이선스의 FOSS가 의도하지 않게 독점 코드와 링크되는 경우에 발생합니다.

source: The first step in our example process is to identify FOSS usage.
ko: 예제 프로세스의 첫번째 단계는 FOSS 사용을 식별하는 것입니다.

source: The first step is to identify the proper parties to initiate a FOSS Review
ko: 첫 번째 단계는 FOSS 리뷰를 시작하기에 적합한 당사자를 식별하는 것입니다.

source: The goal of shareware is to give potential buyers the opportunity to use the program and judge its usefulness before purchasing a license for the full version of the software
ko: 쉐어웨어의 목표는 잠재적인 구매자에게 프로그램의 전체 버전에 대한 라이선스를 구입하기 전에 프로그램을 사용하고 그 유용성을 판단 할 기회를 제공하는 것이다.

source: The legal effect of linking is subject to debate in the FOSS community.
ko: 링킹의 법적 효력은 FOSS 커뮤니티에서 논쟁의 대상이다.

source: The legal team may be supported by others, including:
ko: 다음을 포함하여 다른 사람들이 법률팀을 지원할 수 있습니다:

source: The legal team, which may include in-house or outside attorneys, reviews and evaluates the FOSS usage for license obligations
ko: 사내 또는 외부 변호사를 포함 할 수있는 법무팀이 라이선스 의무에 대한 FOSS 사용을 검토 및 평가합니다.

source: The license can be limited to:
ko: 라이선스는 다음 사항에 제한될 수 있다:

source: The license can have conditions on the grants, meaning you only get the license if you comply with certain obligations
ko: 라이선스에는 부여조건이 있을 수 있는바, 특정 의무를 준수하는 경우에만 라이선스를 취득한다는 의미이다.

source: The license contains a clause restricting use of the names of contributors for endorsement of a derived work without specific permission
ko: 특정 허가 없이 파생 저작물을 인증하기 위해 기여자 이름을 사용하는 것을 제한하는 조항이 포함되어 있다.

source: The method for initiating this process may vary by company, but should be open to those who are involved in using FOSS in development.
ko: 이 프로세스를 시작하는 방법은 회사마다 다를 수 있지만 개발 과정에서 FOSS를 사용하는 사람들에게 개방되어 있어야합니다.

source: The most basic requirement is to include a copyright notice. Permissive licenses do not require source code to be made available to downstream recipients.
ko: 가장 기본적인 요구 사항은 저작권 고지를 포함하는 것입니다. Permissive 라이선스는 다운 스트림 수신자에게 소스 코드를 공개할 것을 요구하지 않습니다.

source: The next few slides explain these concepts in more detail.
ko: 다음 슬라이드에서는 이러한 개념을 보다 자세히 설명합니다.

source: The next step is auditing source code identified in the previous step.
ko: 다음 단계는 이전 단계에서 식별된 소스 코드를 검사하는 것입니다.

source: The origins and licenses of the source code
ko: 소스 코드의 출처와 라이선스

source: The oversight committee may make important policy decisions or resolve disagreements between parties in the review process.
ko: 감독위원회는 중요한 정책 결정을 내릴 수도 있고 검토 과정에서 당사자 간의 불일치를 해결할 수도 있습니다.

source: The package name, version, download URL, license, description and intended use in your product is a good starting point.
ko: 패키지 이름, 버전, 다운로드 URL, 라이선스, 설명 및 제품에서의 사용 목적이 올바른 시작점입니다.

source: The pitfall in this slide arises where a company modifies a FOSS component, then fails to mark its modifications when required by the FOSS license.
ko: 이 슬라이드에서의 함정은 회사가 FOSS 컴포넌트를 수정한 후 FOSS 라이선스에서 요구하는 수정 사항을 표시하지 못한 경우에 발생합니다.

source: The pitfalls in this slide arise from a failure to integrate the FOSS compliance process with the engineering team.
ko: 이 슬라이드에서의 함정은 FOSS 컴플라이언스 프로세스를 엔지니어링팀과 통합하지 못한 경우에 발생합니다.

source: The precisely level of detail you will need depends on your organization and intended use case.
ko: 필요한 정밀도 수준은 조직 및 사용 목적에 따라 달라집니다.

source: The process should be flexible enough so that FOSS users in your organization have access to guidance.
ko: 프로세스는 조직 내의 FOSS 사용자가 가이드에 접근 할 수 있도록 충분히 유연해야합니다.

source: The public domain declaration is not the same as a FOSS license
ko: 퍼블릭 도메인 선언은 FOSS 라이선스와 다르다.

source: The review team may then produce an audit report with its conclusions regarding the origin and licensing of the source code.
ko: 리뷰팀은 소스 코드의 출처와 라이선스에 관한 결론과 함께 검사 보고서를 작성할 수 있습니다.

source: The review team should provide appropriate feedback to the engineering team to resolve the issues.
ko: 리뷰팀은 문제 해결을 위해 엔지니어링팀에 적절한 피드백을 제공해야 합니다.

source: The review team will then create a record of the review, then move to the next step (“Audit”).
ko: 리뷰팀은 리뷰 기록을 작성한 후 다음 단계 ("검사")로 이동합니다.

source: The right to distribute
ko: 배포할 권리

source: The right to reproduce the software – making copies
ko: 소프트웨어를 복제 할 권리 – 복사하기

source: The right to create “ derivative works ” – making modifications
ko: “ 파생 저작물 ”을 만들 권리 – 수정하기

source: The scope of source code availability is determined by the FOSS license.
ko: 소스 코드 입수 가능성의 범위는 FOSS 라이선스에 의해 결정됩니다.

source: The second is to satisfy the obligations.
ko: 둘째는 의무를 충족시키는 것입니다.

source: The second pitfall arises where a company provides accompanying source code, but fails to provide the correct version that matches the distributed binary version.
ko: 두번째 함정은 회사가 동반하는 소스 코드를 제공하지만, 배포된 바이너리 버전과 일치하는 정확한 버전을 제공하지 못하는 경우에 발생합니다.

source: The second pitfall arises where proprietary code is included in copyleft-style licensed FOSS.
ko: 두번째 함정은 독점 코드가 Copyleft 스타일 라이선스의 FOSS에 포함되는 경우에 발생합니다.

source: The source code may or may not be available, and creation of derivative works is usually restricted
ko: 소스 코드가 사용 가능하거나 사용 가능하지 않을 수 있으며, 파생 저작물 생성은 일반적으로 제한된다.

source: The source code should be of the same version and content that corresponds to the binary version you distribute.
ko: 소스 코드는 배포하는 바이너리 버전과 동일한 버전 및 내용이어야 합니다.

source: The step may also begin if the review team discovers or is notified that FOSS is being used in a software release or in third party software used by the company, and that a proper review needs to take place.
ko: 이 단계는 리뷰팀이 FOSS가 소프트웨어 출시 또는 회사에서 사용하는 제3자 소프트웨어에서 사용되고 있는 것과 적절한 리뷰가 필요함을 발견하거나 통보받으면 시작할 수 있습니다.

source: The teams may also organize and track information gathered regarding FOSS usage to assist with later compliance processes.
ko: 이 팀은 이후의 컴플라이언스 프로세스를 지원하기 위해 FOSS 사용과 관련하여 수집된 정보를 구성하고 추적 할 수도 있습니다.

source: The term public domain refers to software not protected by law and therefore usable by the public without requiring a license
ko: 퍼블릭 도메인 은 법의 보호를 받지 않아서 공중이 라이선스없이 사용할 수 있는 소프트웨어를 가르킨다.

source: The term derivative work comes from the US Copyright Act
ko: 파생 저작물이라는 용어는 미국 저작권법에서 비롯된다.

source: The third pitfall arises where a company modifies a FOSS component, but fails to publish the modified version of the source code.
ko: 세번째 함정은 회사가 FOSS 컴포넌트를 수정하지만, 소스 코드의 수정된 버전을 공개하지 못한 경우에 발생합니다.

source: The tracking system should make it clear that a new approval is needed for a new version of a FOSS component or if a new usage model is proposed
ko: 추적 시스템은 새로운 버전의 FOSS 컴포넌트에 대해서나 새로운 사용 모델이 제안되는 경우는 새로운 승인이 필요하다는 점을 명확히 해야 한다.

source: The two main goals of a FOSS compliance program are know your obligations and to satisfy your obligations . The important business practices of a FOSS compliance program include:
ko: FOSS 컴플라이언스 프로그램의 두가지 주요 목표는 귀하의 의무를 이해하고 의무를 이행하는 것 입니다. FOSS 컴플라이언스 프로그램의 중요한 비지니스 행위에는 다음이 포함됩니다.:

source: There are a couple additional issues in the case of external vendors.
ko: 외부 공급 업체의 경우 몇 가지 추가 문제가 있습니다.

source: There are many different automated source code scanning tools.
ko: 다양한 자동화된 소스 코드 스캐닝 도구가 있다.

source: There are other types of license used.
ko: 다른 종류의 라이선스도 사용됩니다.

source: These can be used as the basis for in-house tests for FOSS compliance.
ko: 이들은 FOSS 컴플라이언스를 위한 사내 테스트 자료로 사용될 수 있습니다.

source: These dependencies may be embedded in the FOSS distribution or they may be dependencies resolved at build time.
ko: 이러한 종속성은 FOSS 배포에 포함되거나 빌드 시에 결정된 종속성일 수 있습니다.

source: These licenses often have very different requirements and rules compared to FOSS licenses.
ko: 이러한 라이선스는 종종 FOSS 라이선스에 비해 매우 다른 요구 사항과 규칙을 가지고 있습니다.

source: These representatives may include:
ko: 대표자에는 다음이 포함 될 수 있다:

source: These slides can be used to help train internal teams about FOSS compliance issues and to conform with the OpenChain Specification.
ko: 이 슬라이드는 사내 팀에게 FOSS 컴플라이언스 문제에 대해 교육하고 OpenChain 설명서를 준수하는데 사용할 수 있습니다.

source: These slides follow US law.
ko: 이 슬라이드는 미국 법률을 따름.

source: These slides help companies satisfy the requirements of the Specification Section 1.2.
ko: 이 슬라이드는 회사들이 설명서 1.2의 요구 사항을 충족하는 데 도움이 된다.

source: These teams may provide support using code scanning or forensics tools to identify FOSS components in a codebase.
ko: 이 팀은 코드 스캔 또는 포렌식(forensics)도구를 사용하여 코드베이스의 FOSS 컴포넌트를 식별하는데 도움을 제공 할 수 있습니다.

source: They can also be used for general compliance training.
ko: 또한, 일반 컴플라이언스 교육에도 사용할 수 있다.

source: They require distribution of the original work and derivative works under the same terms as the original work.
ko: 이들은 원본 저작물과 2차적 저작물을 원본 저작물과 동일한 조건으로 배포할 것을 요구합니다.

source: This type of failure can be prevented by mandating engineering staff to take the FOSS training by a specific date
ko: 이러한 유형의 실패는 엔지니어링 직원이 특정 날짜까지 FOSS 교육을 받도록 요구함으로써 예방할 수 있다.

source: This chapter contains an example of a detailed end to end compliance management process.
ko: 이 장에는 엔드 투 엔드 컴플라이언스 관리 프로세스의 상세한 예가 포함되어 있습니다.

source: This chapter covers the big picture of FOSS compliance.
ko: 이 장에서는 FOSS 컴플라이언스의 큰 그림을 다룹니다.

source: This chapter describes a “FOSS Review” process in which FOSS usage is analyzed and the relevant obligations are determined
ko: 이 장에서는 FOSS 사용을 분석하고 관련 의무를 결정하는 "FOSS 리뷰" 프로세스에 대해 설명합니다.

source: This chapter describes some common pitfalls in FOSS compliance processes, and discusses approaches to avoiding these pitfalls
ko: 이 장에서는 FOSS 컴플라이언스 프로세스의 몇 가지 일반적인 함정을 설명하고, 이러한 함정을 방지하기 위한 접근 방식을 설명합니다.

source: This chapter describes some fundamental concepts in understanding FOSS usage
ko: 이 장에서는 FOSS 사용을 이해하는데 있어 몇가지 기본 개념을 설명합니다.

source: This chapter is focused on the “big picture” of Intellectual Property.
ko: 이 장은 지식 재산권의 "큰 그림"에 중점을두고 있습니다.

source: This chapter is probably most useful for managers or developers who might not fully understand the fundamentals of copyright, patent and trademark law.
ko: 이 장은 저작권, 특허 및 상표법의 기본을 완전히 이해하지 못하는 관리자 또는 개발자에게 가장 유용 할 것입니다.

source: This chapter is useful for lawyers, managers or developers who may not be familiar with FOSS licenses.
ko: 이 장은 FOSS 라이선스에 익숙하지 않은 변호사, 관리자 또는 개발자에게 유용합니다.

source: This chapter will describe some potential pitfalls to avoid in the compliance process:
ko: 이 장에서는 컴플라이언스 프로세스에서 피해야 할 잠재적인 함정들에 대해 설명한다.:

source: This chapter will focus on copyright and patents, the areas most relevant to FOSS compliance.
ko: 이 장에서는 FOSS 컴플라이언스와 가장 관련 있는 분야인, 저작권 및 특허권에 초점을 맞춘다.

source: This identifies and publishes the core requirements a FOSS compliance program should satisfy.
ko: 이는 FOSS 컴플라이언스 프로그램이 충족해야하는 핵심 요구 사항을 식별하고 공표한다.

source: This is an example of license incompatibility.
ko: 이것이 라이선스 양립불가능의 예이다.

source: This is an important consideration when choosing code and choosing licenses.
ko: 이는 코드를 선택하고 라이선스를 선택할 때 중요한 고려 사항입니다.

source: This is difficult if the copyrighted work is popular such that it'd be reasonable to assume that you had access. If your software reads on a patent, then you will need a patent license regardless of whether you've independently developed the software.
ko: 만약, 저작권이있는 저작물이 인기가 있어서 접근했다고 가정하는 것이 합리적 일 경우 이는 어렵습니다. 소프트웨어가 특허를 사용할 경우, 소프트웨어를 독립적으로 개발했는지 여부에 관계없이 특허 라이센스가 필요합니다.

source: This is referred to as a “copyleft” or “reciprocal” effect
ko: 이를 "Copyleft" 또는 "상호주의" 효과라고 한다.

source: This is the situation where more than set of license terms can apply to a piece of software. Conjunctive = Multiple licenses apply
ko: 여러 라이선스 조항이 하나의 소프트웨어에 적용될 수 있는 상황입니다. 결합형 (Conjunctive) =여러 라이선스가 적용됩니다.

source: This may be discovered through auditing source code for license notices or using code scanning tools.
ko: 이는 라이선스 고지에 대한 소스 코드 검사 또는 코드 스캐닝 도구를 통해 발견할 수 있습니다.

source: This may include scanning the code to confirm the accuracy of the information.
ko: 여기에는 정보의 정확성을 확인하기 위해 코드를 스캔하는 작업이 포함될 수 있다.

source: This may include:
ko: 여기에는 다음이 포함될 수 있다:

source: This may mean providing the source code along with the software distribution, making it available through a written offer, or posting a source code archive on a website.
ko: 이는 소프트웨어 배포와 함께 소스 코드를 제공하거나, 서명 청약을 통해 제공하거나, 또는 웹사이트에 소스 코드 아카이브를 게시하는 것을 의미할 수 있습니다.

source: This overview is not intended to cover all aspects of Intellectual Property.
ko: 이 개요는 지식 재산권의 모든 측면을 다루기위한 것이 아닙니다.

source: This pitfall may be prevented through implementing processes for marking code or within verification steps.
ko: 이 함정은 확인 단계 내에 소스 코드 수정 표시를 위한 프로세스를 구현함으로 예방할 수 있습니다.

source: This process is where a company can analyze the FOSS software it uses and understand its rights and obligations
ko: 이 프로세스를 통해 회사가 사용하는 FOSS 소프트웨어를 분석하고 권리와 의무를 이해할 수 있다.

source: This process may be assisted by support teams, including teams that run code scanning tools to scan for undisclosed FOSS usage.
ko: 이 프로세스는 코드 스캐닝 도구를 실행하여 알려지지 않은 FOSS 사용을 검색하는 팀을 포함하는 지원팀의 도움을 받을 수 있습니다.

source: This slide emphasizes how a compliance process can and should apply to all FOSS components entering your company.
ko: 이 슬라이드는 컴플라이언스 프로세스가 어떻게 회사에 유입되는 모든 FOSS 컴포넌트에 적용할 수 있는지와 적용되어야 함을 강조합니다.

source: This slide clarifies the most important parts of copyright law to software.
ko: 이 슬라이드는 소프트웨어에 대한 저작권법의 가장 중요한 부분을 분명히합니다.

source: This slide contains a template that may be used to illustrate FOSS usage and its relationship with company software.
ko: 이 슬라이드는 FOSS 사용과 회사 소프트웨어와의 관계를 설명하기 위해 사용할 수 있는 템플릿이 들어 있습니다.

source: This slide describes potential consequences of compliance process failures.
ko: 이 슬라이드에서는 컴플라이언스 프로세스 오류의 잠재적 결과에 대해 설명합니다.

source: This slide describes some of the benefits that compliance brings to an organization beyond the fact of fulfilling the legal obligations of the license.
ko: 이 슬라이드는 컴플라이언스가 라이선스 법적 의무를 이행한다는 사실을 넘어서 조직에 제공하는 몇 가지 이점에 대해 설명합니다.

source: This slide describes the definition of compliance management and its end goals.
ko: 이 슬라이드에서는 컴플라일언스 관리의 정의와 최종 목표에 대해 설명합니다.

source: This slide describes what a Small to Medium Enterprise (SME)might need to do to build and deploy an effective compliance program.
ko: 이 슬라이드는 효과적인 컴플라이언스 프로그램을 구축하고 배포하기 위해 중소기업 (SME)이 해야할 일이 무엇인지 설명합니다.

source: This slide expands on what compliance obligations must be satisfied in typical FOSS licenses.
ko: 이 슬라이드는 일반적인 FOSS 라이선스에서 충족되어야 하는 컴플라이언스 의무를 설명합니다.

source: This slide explains how FOSS compliance programs work in “broad strokes” (a basic overview).
ko: 이 슬라이드는 FOSS 컴플라이언스 프로그램이 어떻게 작동하는지 기본 개요를 설명합니다.

source: This slide explains license compatibility, the way of understanding what licenses can be used together.
ko: 이 슬라이드에서는 라이선스 양립가능성, 함께 사용할 수 있는 라이선스를 이해하는 방법에 대해 설명합니다.

source: This slide explains more about how FOSS compliance practices can work in an organization.
ko: 이 슬라이드는 조직에서의 FOSS 컴플라이언스 실행 방식에 대해 설명합니다.

source: This slide explains notices, the text comments in files that explain authorship and licensing, and which are often regarded as the most important way of knowing what license applies to a file.
ko: 이 슬라이드는 고지, 즉, 저작권 및 라이선스를 설명하는 파일 내 텍스트 주석 및 파일에 적용되는 라이선스를 파악하는 가장 중요한 방법으로 간주되는 텍스트 주석을 설명합니다.

source: This slide explains patent concepts relevant to software.
ko: 이 슬라이드는 소프트웨어와 관련된 특허 개념을 설명합니다.

source: This slide explains proprietary or closed source licenses.
ko: 이 슬라이드에서는 독점 또는 비공개 소스 라이선스에 대해 설명합니다.

source: This slide explains public domain, a type of release that means the work is released without any restrictions whatsoever by the authors.
ko: 이 슬라이드는 저자가 아무 제한 없이 저작물을 공개한다는 공개 유형인 퍼블릭 도메인을 설명합니다.

source: This slide explains reciprocity and Copyleft, a more complex type of FOSS license that have additional requirements above permissive licenses.
ko: 이 슬라이드에서는 permissive 라이선스 이상으로 추가 요구 사항이 있는 보다 복잡한 유형의 FOSS 라이선스 인 상호주의와 Copyleft에 대해 설명합니다.

source: This slide explains some of the concepts behind distribution.
ko: 이 슬라이드는 배포의 기본 개념을 설명합니다.

source: This slide explains that FOSS compliance is really a two-part goal.
ko: 이 슬라이드는 FOSS 컴플라이언스가 실제 두 부분으로 구성된 목표임을 설명합니다.

source: This slide explains that modifying code can impose obligations under FOSS licenses.
ko: 이 슬라이드는 코드 수정이 FOSS 라이선스 하에서 의무를 부과할 수 있음을 설명합니다.
